XMLCF/src/DataProcessors/sps_ДлительныеОперации1/sps_ДлительныеОперации1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>sps_ДлительныеОперации1</name>
  <attributes>
    <name>датаН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>датаК</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Потоков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

XMLCF/src/DataProcessors/sps_ДлительныеОперации1/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.УникальныйИдентификатор = Новый УникальныйИдентификатор();
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиКомандФормы
////Однопоточные операции

&НаКлиенте
Процедура ВыполнитьОперацию(Команда)
	Элементы.СообщениеФорма.ВыделенныйТекст = "";
	ОбновитьОтображениеДанных();
	
	ДлительнаяОперация = НачатьПроведениеДокументовПТ(Объект.датаН,КонецДня(Объект.датаК),
	Объект.УникальныйИдентификатор);
	
	// 2. Подключение обработчика завершения фонового задания.
	//@skip-check undefined-variable
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = "Фоновое выполнение длительных операций";
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал = 2;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииДлительнойОперации", ЭтотОбъект);
	//@skip-check undefined-variable
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

////Многопоточные операции 

&НаКлиенте
Процедура ВыполнитьМногопоточнуюОперацию(Команда)	
	
	ДлительнаяОперация = НачатьМногопоточноеПроведениеДокументовПТ(Объект.датаН,КонецДня(Объект.датаК),
	Объект.УникальныйИдентификатор,Объект.Потоков);
	
	// 2. Подключение обработчика завершения фонового задания.
	//@skip-check undefined-variable
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = "Фоновое выполнение длительных операций";
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
    ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал = 2;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииДлительнойМногопоточнойОперации", ЭтотОбъект);
	//@skip-check undefined-variable
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПриЗавершенииДлительнойОперации(Результат, ДополнительныеПараметры) Экспорт 
	КоличествоПерепроведенныхПТ = 0;	
	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		//@skip-check undefined-variable
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	КоличествоПерепроведенныхПТ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
		
	Элементы.СообщениеФорма.ВыделенныйТекст = "Перепроведено " + КоличествоПерепроведенныхПТ + " документов"; 
	ОбновитьОтображениеДанных();
Конецпроцедуры

&НаСервере
Функция НачатьПроведениеДокументовПТ(ДатаН,ДатаК,УникальныйИдентификатор)
	//"здесь процедура общего модуля которая будет выполняться в ввиде фонового задания"
	//@skip-check undefined-variable
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	//@skip-check undefined-variable
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
	"sps_ДлительныеОперации.ГрупповоеПроведениеДокументов"
	,"ПТ",ДатаН, ДатаК); 
	
КонецФункции

////Многопоточные операции 

&НаКлиенте
Процедура ПриЗавершенииДлительнойМногопоточнойОперации(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		//@skip-check undefined-variable
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
КонецПроцедуры

&НаСервере
Функция НачатьМногопоточноеПроведениеДокументовПТ(ДатаН,ДатаК,УникальныйИдентификатор,КолвоПотоков)
	//"здесь процедура общего модуля будет выполняться в ввиде фонового задания разделенного на потоки"
	НомерПотока = 1;
	
	//@skip-check undefined-variable
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение многопоточной функции'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;

	ТЗобработки 			= ПолучитьТзДляМногопоточнойОперации(ДатаН,ДатаК);	
	ЧислоСтрокВТаблице      = ТЗобработки.Количество();
	ВсегоПотоков            = КолвоПотоков;
	РазмерПорции            = Цел(ЧислоСтрокВТаблице/ВсегоПотоков);
	НачальныйИндексПорции   = 0;
	КонечныйИндексПорции    = РазмерПорции - 1;	
	МассивАдресовВХранилище = Новый Массив;
	ЭтоПоследнийПоток       = Ложь;
	ПараметрыМетода 	= Новый Соответствие; 
	
	Пока НомерПотока <=  КолвоПотоков Цикл 
		ТЗПотока = Новый ТаблицаЗначений;
		ТЗПотока = ТЗобработки.СкопироватьКолонки();
		
		Если НомерПотока = ВсегоПотоков Тогда
			ЭтоПоследнийПоток    = Истина;
			КонечныйИндексПорции = ЧислоСтрокВТаблице - 1; 	
		КонецЕсли; 
		
		Для Инд = НачальныйИндексПорции По КонечныйИндексПорции Цикл
			ЗаполнитьЗначенияСвойств(ТЗПотока.Добавить(), ТЗобработки[Инд]);
		КонецЦикла; 
		
		АдресВХранилище = ПоместитьВоВременноеХранилище(Неопределено);
		МассивАдресовВХранилище.Добавить(АдресВХранилище);
	    КодПотока = "Поток" + НомерПотока;

		ПараметрыПотока = Новый Структура;
		ПараметрыПотока.Вставить("ТЗПотока", ТЗПотока);  
		ПараметрыПотока.Вставить("КомментарийДокумента", "Опа!");
		ПараметрыПотока.Вставить("КодПотока", "Поток" + НомерПотока);
		ПараметрыПотока.Вставить("ВсегоПотоков", ВсегоПотоков);
		ПараметрыПотокаМассив = Новый Массив;
		ПараметрыПотокаМассив.Добавить(ПараметрыПотока);
		ПараметрыПотокаМассив.Добавить(АдресВХранилище);
		
		ПараметрыМетода.Вставить(КодПотока, ПараметрыПотокаМассив);	
		
		Если ЭтоПоследнийПоток Тогда
			Прервать; 
		КонецЕсли;
		
		НачальныйИндексПорции = НачальныйИндексПорции + РазмерПорции;
		КонечныйИндексПорции  = КонечныйИндексПорции  + РазмерПорции ;	
		
		номерПотока = номерПотока + 1;	   	
	КонецЦикла; 
	
//@skip-check undefined-variable
Возврат	 ДлительныеОперации.ВыполнитьФункциюВНесколькоПотоков(
           "sps_ДлительныеОперации.ГрупповоеМногопоточноеПроведениеДокументов", 
            ПараметрыВыполнения, 
            ПараметрыМетода);
КонецФункции

&НаСервере
Функция ПолучитьТзДляМногопоточнойОперации(ДатаН,ДатаК)
	Данные = Новый ТаблицаЗначений(); 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &датаН И &датаК
	|	И РеализацияТоваровУслуг.ПометкаУдаления = Ложь";
	
	Запрос.УстановитьПараметр("датаК", ДатаК);
	Запрос.УстановитьПараметр("датаН", ДатаН);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Данные = РезультатЗапроса.Выгрузить();
	
	возврат Данные;
Конецфункции
#КонецОбласти
